Revit 2024 API
DirectShape.RemoveAllReferenceObjects Method
 Removes all reference objects (if any) from the DirectShape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public void RemoveAllReferenceObjects()
Visual Basic
Public Sub RemoveAllReferenceObjects
Visual C++
public:
void RemoveAllReferenceObjects()
See Also
DirectShape Class
Autodesk.Revit.DB Namespace